app/views/homes/index.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
          </div>
          <% current_user.posts.each do |post| %>