app/views/posts/index.html.erb


                    <% @city.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."city_id" = $1  [["city_id", 1]]