app/controllers/cities_controller.rb

  def show
    city_id = params[:id]
    @city = City.find_by(id: city_id)
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    city = City.new(city_params)

    if city.save
---
INSERT INTO "cities" ("name", "description", "address", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit
    city_id = params[:id]
    @city = City.find_by(id: city_id)
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    city_id = params[:id]
    city = City.find_by(id: city_id)

    if city.update(city_params)
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cities" SET "name" = $1, "image_file_name" = $2, "image_file_size" = $3, "image_updated_at" = $4, "updated_at" = $5 WHERE "cities"."id" = $6  [["name", "Richmond"], ["image_file_name", "barr.jpg"], ["image_file_size", 3058661], ["image_updated_at", 2017-01-05 18:12:01 UTC], ["updated_at", 2017-01-05 18:12:04 UTC], ["id", 1]]