app/controllers/homes_controller.rb

SELECT "users".* FROM "users"
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @user = User.all
    city_id = params[:city_id]
    @city = City.find_by(id: city_id)