app/controllers/posts_controller.rb

  def index
    city_id = params[:city_id]
    @city = City.find_by(id: city_id)
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @post = Post.new
    city_id = params[:city_id]
    @city = City.find_by(id: city_id)
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create

    city = City.find(params[:city_id])
    new_post = Post.new(post_params)
    new_post.user_id = current_user.id


  if new_post.save
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("text", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "Who is Justin"], ["created_at", 2017-01-04 23:49:19 UTC], ["updated_at", 2017-01-04 23:49:19 UTC], ["user_id", 3]]

  def edit
    @user = current_user
    post_id = params[:id]
    @post = Post.find_by(id: post_id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    user = current_user
    post_id = params[:id]
    post = Post.find_by(id: post_id)

   if post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "text" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["text", "Goodnesss Gracious"], ["updated_at", 2017-01-05 17:13:42 UTC], ["id", 2]]

  def destroy
    post_id = params[:id]
    post = Post.find_by(id: post_id)
    post.delete
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]